<html>
<head>

<!--
                 ************************************
                 * Crystal Decisions copyright 2002 *
                 ************************************

-->

<title>Ayuda del Visor interactivo</title>

<A NAME="top"></A>
<TABLE WIDTH = 100% BORDER=2>
<TR>
<TD WIDTH=50% ALIGN=CENTER><B><font size="4">Crystal Decisions</font><BR></TD>
</TR>
</TABLE>


</head>
<body>

<h1>Ayuda del Visor interactivo</h1>

<p>El Visor interactivo le permite ver los datos del informe. Adem&aacute;s, tambi&eacute;n le permite realizar búsquedas complejas en los datos del informe; podr&aacute; llevar a cabo búsquedas de texto y búsquedas basadas en operadores booleanos.</p>

<A NAME="top"></A>
<P>A continuaci&oacute;n se ofrece una lista completa de los temas de esta Ayuda:</P>
<UL>
<li><A href="#_Group_Tree">&Aacute;rbol de grupos</A>
<li><A href="#_Text_Search">Búsqueda de texto</A>
<li><A href="#_Boolean_Search">Asistente de búsqueda avanzada</A>
<li><A href="#_Exporting">Exportar el informe</A>
<li><A href="#_Zoom">Zoom</A>
<li><A href="#_Refresh">Actualizar</A>
<li><A href="#_Print">Imprimir</A>
<li><A href="#_Navigating_by_page">Desplazamiento por p&aacute;ginas</A></li></UL>

<P><HR SIZE=3 NOSHADE>

<h3><I><a name="_Group_Tree"></a>&Aacute;rbol de grupos</h3></I>

<p>El &Aacute;rbol de grupos le ofrece una lista de los valores en que se agrupan los datos del informe. Al hacer clic en el bot&oacute;n &Aacute;rbol de grupos se muestra u oculta el &Aacute;rbol de grupos. Para desplazarse a un grupo concreto del informe, haga clic en el grupo que desee de la lista del &Aacute;rbol de grupos.</p>

<p>Para obtener m&aacute;s informaci&oacute;n, consulte la Ayuda en línea de Crystal Reports (crw.chm) y busque el tema "Agrupamiento".</p>

<p><p><A href="#top">Volver a lista de temas</A></p>

<h3><I><a name="_Text_Search"></a>Búsqueda de texto</h3></I>

<p><IMG src="../images/toolbar/msearchover.gif"> Puede buscar cualquier cadena de texto en el informe. Escriba la cadena en el campo de entrada de texto y haga clic en el bot&oacute;n de búsqueda situado junto al cuadro de texto.</p>

<p><b>Nota</b>: Si se encuentra en la p&aacute;gina dos y lo que busca est&aacute; situado en la primera p&aacute;gina del informe, el visor no lo encontrar&aacute;. Las búsquedas s&oacute;lo pueden realizarse de la p&aacute;gina siguiente en adelante. Es decir, si se encuentra en la p&aacute;gina tres, la búsqueda se realizar&aacute; a partir de la p&aacute;gina cuatro hasta el final del informe.</p>

<p><A href="#top">Volver a lista de temas</A>

<h3><I><a name="_Boolean_Search"></a>Asistente de búsqueda avanzada</h3></I>
<P><IMG src="../images/toolbar/mwizardnextover.gif"> Al hacer clic en el bot&oacute;n "Mostrar/ocultar el Asistente de búsqueda avanzada", el asistente aparecer&aacute; en la parte superior del visor. El asistente le permite realizar búsquedas en datos del informe mediante operadores booleanos. El asistente se iniciar&aacute; en alguna de las tres fichas que posee en funci&oacute;n de c&oacute;mo haya configurado el Administrador el informe.</P>

<P><B>Nota:   </B> En algunos casos, es posible que el Asistente de búsqueda avanzada no est&eacute; disponible en el visor. Depender&aacute; de c&oacute;mo haya configurado el Administrador el informe.</P>

<P><B>Paso 1: Seleccione una condici&oacute;n para los resultados</B></P>
<OL>
<LI>Si est&aacute; en el modo "Estructurado", puede seleccionar un campo y un filtro en los cuadros desplegables.
<p>Si est&aacute; utilizando el "Modo Libre" y desea cambiar al modo "Estructurado", haga clic en el bot&oacute;n "Estructurado" que se encuentra debajo del cuadro de texto.</p>
<LI>Si desea agregar m&aacute;s de un filtro a la condici&oacute;n, haga clic en el bot&oacute;n "Agregar m&aacute;s filtros" que se encuentra debajo del cuadro desplegable.
<p>Si agrega m&aacute;s filtros de los que est&aacute; utilizando, puede dejar en blanco los filtros que no utilice y &eacute;stos ser&aacute;n omitidos al ir al Paso 2. Seleccione los campos del informe que desee que se muestren.<p>
<LI>Cuando termine, haga clic en el bot&oacute;n "Modo Libre" para volver al m&eacute;todo no estructurado para introducir la condici&oacute;n, o vaya al Paso 2: Seleccione los campos del informe que desee que se muestren.
<P>O, para utilizar el "Modo Libre":</P></LI>
</OL>
<OL>
<LI>Escriba una condici&oacute;n en el cuadro de texto.
<LI>Vaya al Paso 2: Seleccione los campos del informe que desee que se muestren.
<P><B>Nota:   </B> Si se encuentra en el "Modo Libre" y la condici&oacute;n es compleja o contiene filtros complejos, no podr&aacute; cambiar al modo "Estructurado".</P>
</LI>
</OL>

<P><b>Paso 2: Seleccione los campos del informe que quiere que se muestren</b></P>
<OL>
<LI>Seleccione los campos que quiere que aparezcan en los resultados de las búsquedas.
<LI>Vaya al Paso 3: Resultados.</LI>
</OL>

<P><B>Paso 3: Resultados</b></P>
<P><B>Nota:   </B> Para guardar los cambios de un paso, deber&aacute; completar ese paso antes de pasar al siguiente.</P>
<P>Ahora el informe muestra la tabla de búsqueda en la que aparece la lista con los resultados de la búsqueda booleana que acaba de realizar. Si no hay informaci&oacute;n que coincida con los criterios introducidos, no se mostrar&aacute; ninguna tabla de búsqueda.</P>
<P><IMG alt="" src="../images/toolbar/mexporttable.gif"> Una vez que la tabla aparece, puede exportar los resultados de la búsqueda a MS Word, MS Excel o a HTML mediante el bot&oacute;n Exportar.</P>
<P><B>Nota:   </B> Si exporta la tabla de búsqueda, deber&aacute; cerrar la ventana Exportar antes de exportar la tabla de nuevo dentro de la misma sesi&oacute;n.</P>
<P>Para cerrar el Asistente de búsqueda avanzada, haga clic de nuevo en el bot&oacute;n Mostrar/ocultar.</P>

<P><A href="#top">Volver a lista de temas</A> </P>

<h3><I><a name="_Exporting"></a>Exportar el informe</h3></I>

<p><IMG src="../images/toolbar/mexportover.gif"> Para exportar el informe, haga clic en el bot&oacute;n Exportar.</p>

<h4>Exportar a Crystal Reports<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">(tm)</SPAN> (RPT)</h4>

<p>Una vez en la p&aacute;gina de exportaci&oacute;n, elija <b>Crystal Reports (RPT)</b> en la lista desplegable y haga clic en el bot&oacute;n <b>Exportar</b>. Podr&aacute; guardar o abrir el informe nuevo.</p>

<h4>Exportar a Adobe Acrobat<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">(tm)</SPAN> (PDF)</h4>

<p>Una vez en la p&aacute;gina de exportaci&oacute;n, elija <b>Formato Acrobat (PDF)</b> en la lista desplegable y haga clic en el bot&oacute;n <b>Exportar</b>. Podr&aacute; guardar o abrir el archivo PDF.</p>

<h4>Exportar a Microsoft Word<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">(tm)</SPAN> (DOC)</h4>

<p>Una vez en la p&aacute;gina de exportaci&oacute;n, elija <b>MS Word</b> en la lista desplegable y haga clic en el bot&oacute;n <b>Exportar</b>. Podr&aacute; guardar o abrir el documento nuevo.</p>

<h4>Exportar a Microsoft Excel<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">(tm)</SPAN> (XLS)</h4>

<p>Una vez en la p&aacute;gina de exportaci&oacute;n, elija <b>MS Excel 97-2000</b> en la lista desplegable y haga clic en el bot&oacute;n <b>Exportar</b>. Podr&aacute; guardar o abrir la hoja de c&aacute;lculo nueva.</p>

<h4>Exportar a Microsoft Excel<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">(tm)</SPAN>, s&oacute;lo datos (XLS)</h4>

<p>Una vez en la p&aacute;gina de exportaci&oacute;n, elija <b>MS Excel 97-2000 (s&oacute;lo datos)</b> en la lista desplegable y haga clic en el bot&oacute;n <b>Exportar</b>. Podr&aacute; guardar o abrir la hoja de c&aacute;lculo nueva.</p>

<h4>Exportar a formato de texto enriquecido (RTF)</h4>

<p>Una vez en la p&aacute;gina de exportaci&oacute;n, elija <b>Formato de texto enriquecido</b> en la lista desplegable y haga clic en el bot&oacute;n <b>Exportar</b>. Podr&aacute; guardar o abrir el documento nuevo.</p>

<p><A href="#top">Volver a lista de temas</A>

<h3><I><a name="_Zoom"></a>Zoom</h3></I>

<p><IMG src="../images/toolbar/mzoom.gif"> Con el bot&oacute;n de zoom puede ver los informes en diferentes tamaños, desde 25% a 400%.</p>

<p><A href="#top">Volver a lista de temas</A>

<h3><I><a name="_Refresh"></a>Actualizar</h3></I>

<p><IMG src="../images/toolbar/mrefreshover.gif"> Para actualizar el informe, haga clic en el bot&oacute;n Actualizar.</p>
<P><B>Nota:   </B> Es posible que en ocasiones el bot&oacute;n Actualizar no se encuentre disponible en el visor; depender&aacute; de c&oacute;mo haya configurado el Administrador el informe.</P>

<p><A href="#top">Volver a lista de temas</A>

<h3><I><a name="_Print"></a>Imprimir</h3></I>

<p><IMG src="../images/toolbar/mprintover.gif"> Para imprimir una copia del informe, haga clic en el bot&oacute;n Imprimir.</p>

<p>Aparecer&aacute; un PDF del informe. En el lector de Adobe Acrobat del explorador, seleccione Imprimir.</p>

<p><A href="#top">Volver a lista de temas</A>

<h3><I><a name="_Navigating_by_page"></a>Desplazamiento por p&aacute;ginas</h3></I>

<p>Como en Crystal Reports, puede desplazarse por el informe mediante los botones "p&aacute;gina siguiente" y "p&aacute;gina anterior" del visor. <B>Nota</B>: &Eacute;stos no son los botones "atr&aacute;s" y "adelante" del explorador. Tambi&eacute;n puede desplazarse a la primera y última p&aacute;ginas del informe.</p>

<p><IMG src="../images/toolbar/mgotopageover.gif"> Tambi&eacute;n puede introducir el número de p&aacute;gina y hacer clic en el bot&oacute;n "Ir a la p&aacute;gina".</p>

<p><A href="#top">Volver a lista de temas</A>

<h3><I><a name="_Search_Results_Table"></a>  </h3></I>

<p><HR SIZE=3 NOSHADE>

<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="2">Crystal Decisions, Inc.<br> <a href="http://www.crystaldecisions.com" target="_blank">http://www.crystaldecisions.com</a><br> Servicios de soporte t&eacute;cnico:<br> <a href="http://www.crystaldecisions.com/ipl/default.asp?destination=support" target="_blank">http://support.crystaldecisions.com </a><br></font></td>
  </tr>
</table>
<P></P>

</body>
</html>
