<html>
<head>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">


<!--
                 ************************************
                 * Crystal Decisions copyright 2002 *
                 ************************************

-->

<title>Aide du visualiseur interactif</title>

<A NAME="top"></A>
<TABLE WIDTH = 100% BORDER=2>
<TR>
<TD WIDTH=50% ALIGN=CENTER><B><font size="4">Crystal Decisions</font><BR></TD>
</TR>
</TABLE>


</head>
<body>

<h1>Aide du visualiseur interactif</h1>

<p>Le visualiseur interactif vous permet de consulter les donn&eacute;es de votre &eacute;tat. Il vous permet &eacute;galement d'effectuer des recherches complexes sur ces donn&eacute;es, et notamment des recherches de texte ou bas&eacute;es sur des op&eacute;rateurs bool&eacute;ens.</p>

<A NAME="top"></A>
<P>Cette aide contient les rubriques suivantes&nbsp;:</P>
<UL>
<li><A href="#_Group_Tree">Arborescence de groupe</A>
<li><A href="#_Text_Search">Recherche de texte</A>
<li><A href="#_Boolean_Search">Assistant de recherche avanc&eacute;e</A>
<li><A href="#_Exporting">Exportation de l'&eacute;tat</A>
<li><A href="#_Zoom">Zoom</A>
<li><A href="#_Refresh">Actualiser</A>
<li><A href="#_Print">Imprimer</A>
<li><A href="#_Navigating_by_page">Navigation par page</A></li></UL>

<P><HR SIZE=3 NOSHADE>

<h3><I><a name="_Group_Tree"></a>Arborescence de groupe</h3></I>

<p>L'arborescence de groupe contient la liste des valeurs qui servent de base au groupement des donn&eacute;es de l'&eacute;tat. Cliquez sur le bouton Arborescence de groupe pour afficher ou masquer ladite arborescence. Pour vous d&eacute;placer jusqu'&agrave; un groupe donn&eacute; de l'&eacute;tat, cliquez sur le groupe concern&eacute; dans la liste de groupes de l'arborescence de groupe.</p>

<p>Pour plus d'informations, reportez-vous &agrave; la rubrique &laquo;&nbsp;Groupement&nbsp;&raquo; de l'aide en ligne de Crystal Reports (crw.chm).</p>

<p><p><A href="#top">Retour &agrave; la liste des rubriques</A></p>

<h3><I><a name="_Text_Search"></a>Recherche de texte</h3></I>

<p><IMG src="../images/toolbar/msearchover.gif"> Vous pouvez rechercher n'importe quelle cha&icirc;ne de texte dans un &eacute;tat. Tapez la cha&icirc;ne dans le champ d'entr&eacute;e pr&eacute;vu &agrave; cet effet, puis cliquez sur le bouton Rechercher situ&eacute; en regard de la zone de texte.</p>

<p><b>Remarque</b>&nbsp;: si vous vous trouvez sur la deuxi&egrave;me page de l'&eacute;tat et que vous recherchez du texte figurant sur la premi&egrave;re page de celui-ci, le visualiseur ne le trouvera pas. En effet, la recherche d&eacute;bute sur la page imm&eacute;diatement apr&egrave;s la page en cours. Ainsi, si vous vous trouvez sur la troisi&egrave;me page, la recherche d&eacute;bute &agrave; la quatri&egrave;me page et s'effectue jusqu'&agrave; la fin de l'&eacute;tat.</p>

<p><A href="#top">Retour &agrave; la liste des rubriques</A>

<h3><I><a name="_Boolean_Search"></a>Assistant de recherche avanc&eacute;e</h3></I>
<P><IMG src="../images/toolbar/mwizardnextover.gif">&nbsp;Lorsque vous cliquez sur le bouton &laquo;&nbsp;Afficher/masquer Assistant de recherche avanc&eacute;e&nbsp;&raquo;, l'Assistant s'affiche dans la partie sup&eacute;rieure du visualiseur. Il vous permet d'effectuer des recherches bool&eacute;ennes sur les donn&eacute;es de votre &eacute;tat. Selon la fa&ccedil;on dont l'administrateur a configur&eacute; votre &eacute;tat, l'Assistant peut commencer la recherche sur n'importe lequel des trois onglets disponibles.</P>

<P><B>Remarque</b>&nbsp;: dans certains cas, il se peut que vous n'ayez pas acc&egrave;s &agrave; l'Assistant de recherche avanc&eacute;e dans votre visualiseur. Son affichage est fonction de la mani&egrave;re dont l'administrateur a configur&eacute; l'&eacute;tat.</P>

<P><B>Etape&nbsp;1&nbsp;- S&eacute;lection d'une condition de recherche</B></P>
<OL>
<LI>Si vous &ecirc;tes en mode &laquo;&nbsp;Structur&eacute;&nbsp;&raquo;, vous pouvez s&eacute;lectionner un champ ou un filtre dans les listes d&eacute;roulantes.
<p>Pour basculer du mode &laquo;&nbsp;Format libre&nbsp;&raquo; au mode &laquo;&nbsp;Structur&eacute;&nbsp;&raquo;, cliquez sur le bouton &laquo;&nbsp;Structur&eacute;&nbsp;&raquo; situ&eacute; en dessous de la zone de texte.</p> 
<LI>Si vous voulez ajouter plusieurs filtres &agrave; la condition, cliquez sur le bouton &laquo;&nbsp;Ajouter d'autres filtres&nbsp;&raquo; situ&eacute; en dessous la zone de liste d&eacute;roulante.
<p>Si, parmi les filtres que vous ajoutez, vous n'en utilisez que certains, laissez ceux inutilis&eacute;s vierges&nbsp;; ils seront ignor&eacute;s &agrave; l'&eacute;tape&nbsp;2 (&laquo;&nbsp;S&eacute;lection des champs d'&eacute;tat &agrave; afficher&nbsp;&raquo;).<p> 
<LI>Une fois que vous avez termin&eacute;, cliquez sur le bouton &laquo;&nbsp;Format libre&nbsp;&raquo; pour revenir &agrave; la m&eacute;thode non structur&eacute;e qui consiste &agrave; entrer la condition. Alternative&nbsp;: passez &agrave; l'&eacute;tape&nbsp;2 (&laquo;&nbsp;S&eacute;lection des champs d'&eacute;tat &agrave; afficher&nbsp;&raquo;).
<P>Ou, pour utiliser le mode &laquo;&nbsp;Format libre&nbsp;&raquo;&nbsp;:</P></LI>
</OL>
<OL>
<LI>Tapez une condition dans la zone de texte. 
<LI>Passez &agrave; l'&eacute;tape&nbsp;2&nbsp;(&laquo;&nbsp;S&eacute;lection des champs d'&eacute;tat &agrave; afficher&nbsp;&raquo;).  
<P><B>Remarque</b>&nbsp;: si vous &ecirc;tes en mode &laquo;&nbsp;Format libre&nbsp;&raquo; et que votre condition est compliqu&eacute;e ou qu'elle contient des filtres complexes, vous ne pourrez pas basculer en mode &laquo;&nbsp;Structur&eacute;&nbsp;&raquo;.</P>
</LI>
</OL>

<P><b>Etape&nbsp;2&nbsp;- S&eacute;lection des champs d'&eacute;tat &agrave; afficher</b></P>
<OL>
<LI>S&eacute;lectionnez les champs que vous voulez afficher dans les r&eacute;sultats de la recherche. 
<LI>Passez &agrave; l'&eacute;tape&nbsp;3 (&laquo;&nbsp;R&eacute;sultats&nbsp;&raquo;).</LI>
</OL>

<P><B>Etape&nbsp;3&nbsp;- R&eacute;sultats</b></P>
<P><B>Remarque</b>&nbsp;: pour enregistrer les modifications effectu&eacute;es au cours d'une &eacute;tape, vous devez achever cette &eacute;tape avant de passer &agrave; la suivante.</P>
<P>L'&eacute;tat contient maintenant la table de recherche qui r&eacute;pertorie les r&eacute;sultats de la recherche bool&eacute;enne effectu&eacute;e. Si la recherche ne trouve pas de donn&eacute;es correspondant aux crit&egrave;res sp&eacute;cifi&eacute;s, aucune table de recherche n'est affich&eacute;e.</P>
<P><IMG alt="" src="../images\toolbar\mexporttable.gif"> Une fois la table affich&eacute;e, vous pouvez exporter les r&eacute;sultats de la recherche dans un fichier MS Word, MS Excel ou HTML &agrave; l'aide du bouton Exporter.</P>
<P><B>Remarque</b>&nbsp;: si vous exportez la table de recherche, vous devez fermer la fen&ecirc;tre d'exportation avant d'entamer une nouvelle exportation de la table au cours de la m&ecirc;me session.</P>
<P>Cliquez de nouveau sur le bouton Afficher/masquer Assistant de recherche avanc&eacute;e pour fermer l'Assistant.</P>

<P><A href="#top">Retour &agrave; la liste des rubriques</A> </P>

<h3><I><a name="_Exporting"></a>Exportation de l'&eacute;tat</h3></I>

<p><IMG src="../images/toolbar/mexportover.gif"> Pour exporter votre &eacute;tat, cliquez sur le bouton Exporter.</p>

<h4>Exportation au format Crystal Reports<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">™</SPAN>&nbsp;(RPT)</h4>

<p>Une fois sur la page Exporter, s&eacute;lectionnez <b>Crystal Reports (RPT)</b> dans la liste d&eacute;roulante, puis cliquez sur <b>Exporter</b>. Vous pouvez ensuite enregistrer votre nouvel &eacute;tat ou l'ouvrir.</p>

<h4>Exportation au format Adobe Acrobat<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">™</SPAN>&nbsp;(PDF)</h4>

<p>Une fois sur la page Exporter, s&eacute;lectionnez <b>Format Acrobat&nbsp;(PDF)</b> dans la liste d&eacute;roulante, puis cliquez sur <b>Exporter</b>. Vous pouvez ensuite enregistrer le fichier&nbsp;PDF ou l'ouvrir.</p>

<h4>Exportation au format Microsoft Word<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">™</SPAN>&nbsp;(DOC)</h4>

<p>Une fois sur la page Exporter, s&eacute;lectionnez <b>MS Word</b> dans la liste d&eacute;roulante, puis cliquez sur <b>Exporter</b>. Vous pouvez ensuite enregistrer le nouveau document ou l'ouvrir.</p>

<h4>Exportation au format Microsoft Excel<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">™</SPAN>&nbsp;(XLS)</h4>

<p>Une fois sur la page Exporter, s&eacute;lectionnez <b>MS Excel 97-2000</b> dans la liste d&eacute;roulante, puis cliquez sur <b>Exporter</b>. Vous pouvez ensuite enregistrer la nouvelle feuille de calcul ou l'ouvrir.</p>

<h4>Exportation au format Microsoft Excel<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">™</SPAN>, donn&eacute;es uniquement (XLS)</h4>

<p>Une fois sur la page Exporter, s&eacute;lectionnez <b>MS Excel 97-2000 (donn&eacute;es uniquement)</b> dans la liste d&eacute;roulante, puis cliquez sur <b>Exporter</b>. Vous pouvez ensuite enregistrer la nouvelle feuille de calcul ou l'ouvrir.</p>

<h4>Exportation au format&nbsp;RTF (Rich Text Format)</h4>

<p>Une fois sur la page Exporter, s&eacute;lectionnez <b>Format RTF</b> dans la liste d&eacute;roulante, puis cliquez sur <b>Exporter</b>. Vous pouvez ensuite enregistrer le nouveau document ou l'ouvrir.</p>

<p><A href="#top">Retour &agrave; la liste des rubriques</A>

<h3><I><a name="_Zoom"></a>Zoom</h3></I>

<p><IMG src="../images/toolbar/mzoom.gif"> Le bouton Zoom permet d'afficher votre &eacute;tat en diverses tailles variant de 25&nbsp;% &agrave; 400&nbsp;%.</p>

<p><A href="#top">Retour &agrave; la liste des rubriques</A>

<h3><I><a name="_Refresh"></a>Actualisation</h3></I>

<p><IMG src="../images/toolbar/mrefreshover.gif"> Pour actualiser votre &eacute;tat, cliquez sur le bouton Actualiser.</p>
<P><B>Remarque</b>&nbsp;: selon la fa&ccedil;on dont l'administrateur a configur&eacute; votre &eacute;tat, le bouton Actualiser peut ne pas &ecirc;tre disponible dans votre visualiseur.</P>

<p><A href="#top">Retour &agrave; la liste des rubriques</A>

<h3><I><a name="_Print"></a>Impression</h3></I>

<p><IMG src="../images/toolbar/mprintover.gif"> Pour imprimer une copie de votre &eacute;tat, cliquez sur le bouton Imprimer.</p>

<p>L'&eacute;tat s'affiche sous forme de document&nbsp;PDF. S&eacute;lectionnez la commande Imprimer &agrave; partir d'Adobe Acrobat Reader dans votre navigateur.</p>

<p><A href="#top">Retour &agrave; la liste des rubriques</A>

<h3><I><a name="_Navigating_by_page"></a>Navigation par page</h3></I>

<p>Vous pouvez parcourir votre &eacute;tat &agrave; l'aide des boutons Page suivante et Page pr&eacute;c&eacute;dente du visualiseur, comme vous le faites dans Crystal Reports. <B>Remarque</B>&nbsp;: ces boutons sont diff&eacute;rents des boutons &laquo;&nbsp;Pr&eacute;c&eacute;dent&nbsp;&raquo; et &laquo;&nbsp;Suivant&nbsp;&raquo; du navigateur. Vous pouvez aussi acc&eacute;der &agrave; la premi&egrave;re ou &agrave; la derni&egrave;re page de l'&eacute;tat.</p>

<p><IMG src="../images/toolbar/mgotopageover.gif"> Vous pouvez &eacute;galement entrer un num&eacute;ro de page et cliquer sur le bouton Aller &agrave; la page.</p>

<p><A href="#top">Retour &agrave; la liste des rubriques</A>

<h3><I><a name="_Search_Results_Table"></a>  </h3></I>

<p><HR SIZE=3 NOSHADE>

<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="2">Crystal Decisions, Inc.<br> <a href="http://www.crystaldecisions.com" target="_blank">http://www.crystaldecisions.com</a><br> Support technique&nbsp;:<br> <a href="http://www.crystaldecisions.com/ipl/default.asp?destination=support" target="_blank">http://support.crystaldecisions.com</a><br></font></td>
  </tr>
</table>
<P></P>

</body>
</html>