<html>
<head>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">


<!--
                 ************************************
                 * Crystal Decisions copyright 2002 *
                 ************************************

-->

<title>Hilfe zum interaktiven Viewer</title>

<A NAME="top"></A>
<TABLE WIDTH = 100% BORDER=2>
<TR>
<TD WIDTH=50% ALIGN=CENTER><B><font size="4">Crystal Decisions</font><BR></TD>
</TR>
</TABLE>


</head>
<body>

<h1>Hilfe zum interaktiven Viewer</h1>

<p>Mit dem interaktiven Viewer k&ouml;nnen Sie Berichtdaten anzeigen. Dar&uuml;ber hinaus unterst&uuml;tzt er komplexe Suchen in Berichtdaten, und Sie k&ouml;nnen Textsuchen sowie Suchabfragen unter Verwendung boolescher Operatoren durchf&uuml;hren.</p>

<A NAME="top"></A>
<P>Die folgende Liste enth&auml;lt alle in dieser Hilfe behandelten Themen:</P>
<UL>
<li><A href="#_Group_Tree">Gruppenstruktur</A>
<li><A href="#_Text_Search">Textsuche</A>
<li><A href="#_Boolean_Search">Assistent f&uuml;r die erweiterte Suche</A>
<li><A href="#_Exporting">Exportieren des Berichts</A>
<li><A href="#_Zoom">Zoomen</A>
<li><A href="#_Refresh">Aktualisieren</A>
<li><A href="#_Print">Drucken</A>
<li><A href="#_Navigating_by_page">Seitenweises Navigieren</A></li></UL>

<P><HR SIZE=3 NOSHADE>

<h3><I><a name="_Group_Tree"></a>Gruppenstruktur</h3></I>

<p>In der Gruppenstruktur sind die Werte aufgelistet, nach denen die Berichtdaten gruppiert sind. Durch Klicken auf die Schaltfl&auml;che <b>Gruppenstruktur</b> wird die Gruppenstruktur ein- bzw. ausgeblendet. Um zu einer bestimmten Gruppe im Bericht zu navigieren, klicken Sie in der Gruppenstruktur in der Gruppenliste auf die betreffende Gruppe.</p>

<p>Weitere Informationen finden Sie in der Crystal Reports-Online-Hilfe (crw.chm) unter dem Thema &quot;Gruppierung&quot;.</p>

<p><p><A href="#top">Zur&uuml;ck zur Themenliste</A></p>

<h3><I><a name="_Text_Search"></a>Textsuche</h3></I>

<p><IMG src="../images/toolbar/msearchover.gif"> Im Bericht k&ouml;nnen beliebige Textzeichenfolgen gesucht werden. Geben Sie die Zeichenfolge im Texteingabefeld ein, und klicken Sie auf die Schaltfl&auml;che <b>Suchen</b> neben dem Textfeld.</p>

<p><b>Hinweis</b>: Wenn Sie sich auf Seite 2 befinden, der gesuchte Begriff aber auf Seite 1 steht, wird er vom Viewer nicht gefunden. Die Suche beginnt immer auf der n&auml;chsten Seite und verl&auml;uft vorw&auml;rts. Wenn Sie sich also auf Seite 3 befinden, wird nur der Bereich von Seite 4 bis zum Berichtende durchsucht.</p>

<p><A href="#top">Zur&uuml;ck zur Themenliste</A>

<h3><I><a name="_Boolean_Search"></a>Assistent f&uuml;r die erweiterte Suche</h3></I>
<P><IMG src="../images/toolbar/mwizardnextover.gif">&nbsp;Wenn Sie auf die Schaltfl&auml;che <b>Assistent f&uuml;r die erweiterte Suche ein/aus</b> klicken, wird der Assistent im oberen Bereich des Viewers angezeigt. Der Assistent erm&ouml;glicht es Ihnen, Berichtdaten mit Hilfe von booleschen Operatoren zu durchsuchen. Welche der drei Registerkarten beim Starten angezeigt wird, h&auml;ngt davon ab, wie der Bericht vom Administrator eingerichtet wurde.</P>

<P><B>Hinweis:</B> In einigen F&auml;llen kann der Assistent f&uuml;r die erweiterte Suche im Viewer nicht verf&uuml;gbar sein. Dies h&auml;ngt davon ab, wie der Bericht vom Administrator eingerichtet wurde.</P>

<P><B>Schritt 1: W&auml;hlen Sie eine Bedingung f&uuml;r die Ergebnisse aus</B></P>
<OL>
<LI>Wenn Sie sich im Modus &quot;Strukturiert&quot; befinden, k&ouml;nnen Sie ein Feld und einen Filter aus den Dropdownfeldern ausw&auml;hlen.
<p>Wenn Sie den Modus &quot;Freiformplatzierung&quot; verwenden und zum Modus &quot;Strukturiert&quot; wechseln m&ouml;chten, klicken Sie unterhalb des Textfeldes auf die Schaltfl&auml;che <b>Strukturiert</b> .</p> 
<LI>Wenn Sie der Bedingung mehr als einen Filter hinzuf&uuml;gen m&ouml;chten, klicken Sie unterhalb des Dropdownfeldes auf die Schaltfl&auml;che <b>Weitere Filter hinzuf&uuml;gen</b>.
<p>Wenn Sie mehr Filter hinzuf&uuml;gen als verwendet werden, brauchen Sie f&uuml;r die nicht ben&ouml;tigten Filter nichts einzugeben. Diese Filter werden ignoriert, wenn Sie mit Schritt 2 fortfahren: W&auml;hlen Sie die anzuzeigenden Felder aus dem Bericht aus.<p> 
<LI>Wenn Sie fertig sind, klicken Sie auf die Schaltfl&auml;che <b>Freiformplatzierung</b>, um die Bedingung nach der unstrukturierten Methode einzugeben. Oder wechseln Sie zu Schritt 2: W&auml;hlen Sie die anzuzeigenden Felder aus dem Bericht aus.
<P>Oder verwenden Sie den Modus &quot;Freiformplatzierung&quot;:</P></LI>
</OL>
<OL>
<LI>Geben Sie eine Bedingung in das Textfeld ein. 
<LI>Wechseln Sie zu Schritt 2: W&auml;hlen Sie die anzuzeigenden Felder aus dem Bericht aus.  
<P><B>Hinweis:</B> Wenn Sie sich im Modus &quot;Freiformplatzierung&quot; befinden und die Bedingung komplex ist bzw. komplexe Filter enth&auml;lt, besteht keine M&ouml;glichkeit, in den Modus &quot;Strukturiert&quot; zu wechseln.</P>
</LI>
</OL>

<P><b>Schritt 2: W&auml;hlen Sie die anzuzeigenden Felder aus dem Bericht aus</b></P>
<OL>
<LI>W&auml;hlen Sie die Felder aus, die in den Suchergebnissen angezeigt werden sollen. 
<LI>Wechseln Sie zu Schritt 3: Ergebnisse.</LI>
</OL>

<P><B>Schritt 3: Ergebnisse</b></P>
<P><B>Hinweis:</B> Um alle &Auml;nderungen gleichzeitig zu speichern, m&uuml;ssen Sie diesen Schritt ausf&uuml;hren, bevor Sie mit dem n&auml;chsten Schritt fortfahren.</P>
<P>Im Bericht wird jetzt die Suchtabelle mit den Ergebnissen der gerade ausgef&uuml;hrten booleschen Suche angezeigt. Falls es keine Daten gibt, die mit den eingegebenen Kriterien &uuml;bereinstimmen, wird keine Suchtabelle angezeigt.</P>
<P><IMG alt="" src="../images\toolbar\mexporttable.gif"> Sobald die Tabelle angezeigt wird, k&ouml;nnen Sie die Suchergebnisse mit Hilfe der Schaltfl&auml;che <b>Exportieren</b> in MS Word, MS Excel oder HTML exportieren.</P>
<P><B>Hinweis:</B> Beim Exportieren der Suchtabelle m&uuml;ssen Sie das Exportfenster schlie&szlig;en, bevor die Tabelle in derselben Sitzung erneut exportiert wird.</P>
<P>Um den Assistenten f&uuml;r die erweiterte Suche zu schlie&szlig;en, klicken Sie erneut auf die Schaltfl&auml;che <b>Ein-/Ausblenden</b>.</P>

<P><A href="#top">Zur&uuml;ck zur Themenliste</A> </P>

<h3><I><a name="_Exporting"></a>Exportieren des Berichts</h3></I>

<p><IMG src="../images/toolbar/mexportover.gif"> Um den Bericht zu exportieren, klicken Sie auf die Schaltfl&auml;che <b>Exportieren</b>.</p>

<h4>Exportieren in Crystal Reports<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">™</SPAN> (RPT)</h4>

<p>Sobald Sie sich auf der Seite <b>Exportieren</b> befinden, w&auml;hlen Sie in der Dropdownliste <b>Crystal Reports (RPT)</b> aus und klicken auf die Schaltfl&auml;che <b>Exportieren</b>. Sie k&ouml;nnen den neuen Bericht entweder speichern oder &ouml;ffnen.</p>

<h4>Exportieren in Adobe Acrobat<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">™</SPAN> (PDF)</h4>

<p>Sobald Sie sich auf der Seite <b>Exportieren</b> befinden, w&auml;hlen Sie in der Dropdownliste <b>Acrobat-Format (PDF)</b> aus und klicken auf die Schaltfl&auml;che <b>Exportieren</b>. Sie k&ouml;nnen die PDF-Datei entweder speichern oder &ouml;ffnen.</p>

<h4>Exportieren in Microsoft Word<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">™</SPAN> (DOC)</h4>

<p>Sobald Sie sich auf der Seite <b>Exportieren</b> befinden, w&auml;hlen Sie in der Dropdownliste <b>MS Word</b> aus und klicken auf die Schaltfl&auml;che <b>Exportieren</b>. Sie k&ouml;nnen das neue Dokument speichern oder &ouml;ffnen.</p>

<h4>Exportieren in Microsoft Excel<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">™</SPAN> (XLS)</h4>

<p>Sobald Sie sich auf der Seite <b>Exportieren</b> befinden, w&auml;hlen Sie in der Dropdownliste <b>MS Excel 97-2000</b> aus und klicken auf die Schaltfl&auml;che <b>Exportieren</b>. Sie k&ouml;nnen die neue Kalkulationstabelle speichern oder &ouml;ffnen.</p>

<h4>Exportieren in Microsoft Excel<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: 'Times New Roman'; mso-fareast-font-family: 'Times New Roman'; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA">™</SPAN>, nur Daten (XLS)</h4>

<p>Sobald Sie sich auf der Seite <b>Exportieren</b> befinden, w&auml;hlen Sie in der Dropdownliste <b>MS Excel 97-2000 (nur Daten)</b> aus und klicken auf die Schaltfl&auml;che <b>Exportieren</b>. Sie k&ouml;nnen die neue Kalkulationstabelle speichern oder &ouml;ffnen.</p>

<h4>Exportieren in das RTF-Format (Rich Text Format).</h4>

<p>Sobald Sie sich auf der Seite <b>Exportieren</b> befinden, w&auml;hlen Sie in der Dropdownliste <b>Rich Text Format</b> aus und klicken auf die Schaltfl&auml;che <b>Exportieren</b>. Sie k&ouml;nnen das neue Dokument speichern oder &ouml;ffnen.</p>

<p><A href="#top">Zur&uuml;ck zur Themenliste</A>

<h3><I><a name="_Zoom"></a>Zoomen</h3></I>

<p><IMG src="../images/toolbar/mzoom.gif"> Durch die Verwendung der Schaltfl&auml;che <b>Zoomen</b> k&ouml;nnen Sie den Bericht in unterschiedlichen Gr&ouml;&szlig;en von 25 % bis 400 % darstellen.</p>

<p><A href="#top">Zur&uuml;ck zur Themenliste</A>

<h3><I><a name="_Refresh"></a>Aktualisieren</h3></I>

<p><IMG src="../images/toolbar/mrefreshover.gif"> Um den Bericht zu aktualisieren, klicken Sie auf die Schaltfl&auml;che <b>Aktualisieren</b>.</p>
<P><B>Hinweis:</B> In einigen F&auml;llen ist die Schaltfl&auml;che <B>Aktualisieren</B> im Viewer nicht verf&uuml;gbar. Dies h&auml;ngt davon ab, wie der Administrator den Bericht eingerichtet hat.</P>

<p><A href="#top">Zur&uuml;ck zur Themenliste</A>

<h3><I><a name="_Print"></a>Drucken</h3></I>

<p><IMG src="../images/toolbar/mprintover.gif"> Um ein Berichtexemplar auszudrucken, klicken Sie auf die Schaltfl&auml;che <B>Drucken</B>.</p>

<p>Der Bericht wird im PDF-Format angezeigt. W&auml;hlen Sie im Adobe Acrobat Reader im Browser die Druckoption.</p>

<p><A href="#top">Zur&uuml;ck zur Themenliste</A>

<h3><I><a name="_Navigating_by_page"></a>Seitenweises Navigieren</h3></I>

<p>Wie in Crystal Reports k&ouml;nnen Sie im Bericht navigieren, indem Sie im Viewer die Schaltfl&auml;chen <B>N&auml;chste Seite</B> und <B>Vorherige Seite</B> verwenden. <B>Hinweis</B>: Diese sind nicht mit den Schaltfl&auml;chen <B>Vorw&auml;rts</B> und <B>Zur&uuml;ck</B> des Browsers zu verwechseln. Sie k&ouml;nnen auch zur ersten bzw. letzten Seite des Berichts navigieren.</p>

<p><IMG src="../images/toolbar/mgotopageover.gif"> Sie k&ouml;nnen auch die Seitenzahl eingeben und auf die Schaltfl&auml;che <B>Gehe zu Seite</B> klicken.</p>

<p><A href="#top">Zur&uuml;ck zur Themenliste</A>

<h3><I><a name="_Search_Results_Table"></a>  </h3></I>

<p><HR SIZE=3 NOSHADE>

<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="2">Crystal Decisions, Inc.<br> <a href="http://www.crystaldecisions.com" target="_blank">http://www.crystaldecisions.com/</a><br> Supportleistungen:<br> <a href="http://www.crystaldecisions.com/ipl/default.asp?destination=support" target="_blank">http://support.crystaldecisions.com/</a><br></font></td>
  </tr>
</table>
<P></P>

</body>
</html>